compressible/dpEqn_Semi-Implicit_Inplace_GCIBM(sphere)/case/0/gas/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    TOP
    {
        type            waveTransmissive;
        field           U;
        phi             USn;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        (0 0 0);
        lInf            10;
        value           $internalField;
    }

    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    FRONT
    {
        type            empty;
    }

    BACK
    {
        type            empty;
    }

    LEFT
    {
        type            zeroGradient;
    }

    RIGHT
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
